NTURacingTeam/nturt_stm32_front_box/Core/Src/sensors.c
    if((uint32_t)pvTimerGetTimerID(timer) % (steer_angle_period/SENSOR_TIMER_PERIOD) == 0) {
        xTaskNotify(sensors_data_task_handle, FLAG_READ_STEER, eSetBits);
    }

    if((uint32_t)pvTimerGetTimerID(timer) >= TIRE_TEMP_PERIOD/SENSOR_TIMER_PERIOD) {
        xTaskNotify(sensors_data_task_handle, FLAG_READ_TIRE_TEMP, eSetBits);
        vTimerSetTimerID(timer, (void*)0);
    }
}


/**
 * @brief handler function for the data acquisition task of the pedal sensors
 * 
 */
void sensor_handler(void* argument) {
    //dma buffer zone
    static __dma_buffer adc_dma_buffer_t adc_dma_buffer = {0};
    static __dma_buffer i2c_d6t_dma_buffer_t d6t_dma_buffer_R = {0};
    static __dma_buffer i2c_d6t_dma_buffer_t d6t_dma_buffer_L = {0};
    static __dma_buffer uint8_t spi_rx_buffer[4] = {0};
    static __dma_buffer uint8_t spi_tx_buffer[4] = {0};

    timer_time_t hall_time_L_last = {0};
    timer_time_t hall_time_R_last = {0};

    //variables that tracks how long have the sensors been in an implausible state
    struct {
        struct {
            uint16_t high;
            uint16_t low;
        } apps1;
        struct {
            uint16_t high;
            uint16_t low;
        } apps2;
        struct {
            uint16_t high;
            uint16_t low;
        } bse;
        uint16_t apps_disagree;
    } pedal_err_count = {0};

    //TODO: handle every return status of FreeRTOS and HAL API
    (void)argument;
    //variable to store the pending flags that is sent from xTaskNotify
    uint32_t pending_notifications = 0U;

    /*initialize D6T sensors*/
    //first wait for 20ms for the D6T sensors to boot up
#ifdef USE_D6T
    vTaskDelay(pdMS_TO_TICKS(20));

   if(init_D6T(&hi2c5, &d6t_dma_buffer_R, FLAG_D6T_STARTUP, &pending_notifications)) {
       Error_Handler();
   }
   if(init_D6T(&hi2c1, &d6t_dma_buffer_L, FLAG_D6T_STARTUP, &pending_notifications)) {
       Error_Handler();
   }
    
    //wait for 500ms after initialization of D6T
    vTaskDelay(pdMS_TO_TICKS(500));
#endif

    /*initialize the pedal sensors' compensation*/
    //calib the adc
    HAL_ADCEx_Calibration_Start(&hadc1, ADC_CALIB_OFFSET_LINEARITY, ADC_SINGLE_ENDED);
    HAL_ADCEx_Calibration_Start(&hadc3, ADC_CALIB_OFFSET_LINEARITY, ADC_SINGLE_ENDED);

    //wait until the pedals are set back to zero
    while(  HAL_GPIO_ReadPin(MICRO_APPS_GPIO_Port, MICRO_APPS_Pin) != GPIO_PIN_RESET ||
            HAL_GPIO_ReadPin(MICRO_BSE_GPIO_Port, MICRO_BSE_Pin) != GPIO_PIN_RESET ) {
        vTaskDelay(pdMS_TO_TICKS(3));
    }

    HAL_ADC_Start_DMA(&hadc1, (uint32_t*)&(adc_dma_buffer.apps1), 4);
    HAL_ADC_Start_DMA(&hadc3, (uint32_t*)&(adc_dma_buffer.apps2), 3);
    //wait for both flags to be set
    if(wait_for_notif_flags(FLAG_ADC1_FINISH | FLAG_ADC3_FINISH, ADC_TIMEOUT, &pending_notifications) != pdTRUE) {
        Error_Handler();
    }
    const float apps1_compensation = - APPS1_transfer_function(adc_dma_buffer.apps1, 0);
    const float apps2_compensation = - APPS2_transfer_function(adc_dma_buffer.apps2, 0);
    const float bse_compensation = - BSE_transfer_function(adc_dma_buffer.bse, 0);
    
    //start the initial read, and start the timer that should later notifies this task to do stuff again
    xTaskNotify(xTaskGetCurrentTaskHandle(), FLAG_READ_SUS_PEDAL | FLAG_READ_TIRE_TEMP, eSetBits);
    if(xTimerStart(sensor_timer_handle, portMAX_DELAY) != pdPASS) {
        Error_Handler();
    }

    //start the hall timer
#ifdef USE_HALL_SENSOR
    HAL_TIM_Base_Start_IT(&htim7);
#endif

    while(1) {
        if(!pending_notifications) {
            //wait for notifications from timer if there are no pending ones
            (void)xTaskNotifyWait(0, 0xFFFFFFFFUL, &pending_notifications, portMAX_DELAY);
        }

        if(pending_notifications & FLAG_READ_SUS_PEDAL) {
            pending_notifications &= ~FLAG_READ_SUS_PEDAL; //clear bit

            if(HAL_ADC_Start_DMA(&hadc1, (uint32_t*)&(adc_dma_buffer.apps1), 4) != HAL_OK) {
                if(ADC_request_retry(&hadc1, &adc_dma_buffer.apps1, 4, 3)) {
                    ErrorHandler_write_error(&error_handler, ERROR_CODE_ADC, ERROR_SET);
                    break;
                }
            }
            if(HAL_ADC_Start_DMA(&hadc3, (uint32_t*)&(adc_dma_buffer.apps2), 3) != HAL_OK) {
                if(ADC_request_retry(&hadc3, &adc_dma_buffer.apps2, 3, 3)) {
                    ErrorHandler_write_error(&error_handler, ERROR_CODE_ADC, ERROR_SET);
                    break;
                }
            }

            const uint8_t micro_apps = (uint8_t)HAL_GPIO_ReadPin(MICRO_APPS_GPIO_Port, MICRO_APPS_Pin);
            const uint8_t micro_bse = (uint8_t)HAL_GPIO_ReadPin(MICRO_BSE_GPIO_Port, MICRO_BSE_Pin);

            xSemaphoreTake(pedal.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                pedal.micro_apps = micro_apps;
                pedal.micro_bse = micro_bse;
            xSemaphoreGive(pedal.mutex);

            //wait for both flags to be set
            if (wait_for_notif_flags(FLAG_ADC1_FINISH | FLAG_ADC3_FINISH, pdMS_TO_TICKS(ADC_TIMEOUT), &pending_notifications) != pdTRUE) {
                //edge case where only one or neither flags set
                const uint32_t is_ADC1_done = pending_notifications & FLAG_ADC1_FINISH;
                const uint32_t is_ADC3_done = pending_notifications & FLAG_ADC3_FINISH;
                if(!is_ADC3_done) {
                    if(ADC_retry(&hadc3, &adc_dma_buffer.apps2, 3, 3, &pending_notifications)) {
                        pending_notifications &= ~(FLAG_ADC1_FINISH | FLAG_ADC3_FINISH);
                        ErrorHandler_write_error(&error_handler, ERROR_CODE_ADC, ERROR_SET);
                        break;
                    }
                }
                if(!is_ADC1_done) {
                    if(ADC_retry(&hadc1, &adc_dma_buffer.apps1, 4, 3, &pending_notifications)) {
                        pending_notifications &= ~(FLAG_ADC1_FINISH | FLAG_ADC3_FINISH);
                        ErrorHandler_write_error(&error_handler, ERROR_CODE_ADC, ERROR_SET);
                        break;
                    }
                }
            }

        
            //TODO: another error handler for implausibility
            float apps1_filtered, apps2_filtered, bse_filtered;
            MovingAverageFilter_update(&moving_average_filter[0], APPS1_transfer_function(adc_dma_buffer.apps1, apps1_compensation), &apps1_filtered);
            MovingAverageFilter_update(&moving_average_filter[1], APPS2_transfer_function(adc_dma_buffer.apps2, apps2_compensation), &apps2_filtered);
            MovingAverageFilter_update(&moving_average_filter[2], BSE_transfer_function(adc_dma_buffer.bse, bse_compensation), &bse_filtered);
            const float apps1 = fuzzy_edge_remover(apps1_filtered, 1.0, 0.0, 0.01);
            const float apps2 = fuzzy_edge_remover(apps2_filtered, 1.0, 0.0, 0.01);
            const float bse = fuzzy_edge_remover(bse_filtered, 1.0, 0.0, 0.01);

            Error_report(ERROR_CODE_APPS1_HIGH, &pedal_err_count.apps1.high, apps1 > 1.0 ? true : false);
            Error_report(ERROR_CODE_APPS1_LOW, &pedal_err_count.apps1.low, apps1 < 0.0 ? true : false);
            Error_report(ERROR_CODE_APPS2_HIGH, &pedal_err_count.apps2.high, apps2 > 1.0 ? true : false);
            Error_report(ERROR_CODE_APPS2_LOW, &pedal_err_count.apps2.low, apps2 < 0.0 ? true : false);
            Error_report(ERROR_CODE_APPS_DIVERGE, &pedal_err_count.apps_disagree, apps1-apps2 > 0.1 || apps2-apps1 > 0.1 ? true : false);
            // Error_report(ERROR_CODE_BSE_HIGH, &pedal_err_count.bse.high, bse > 1.0 ? true : false);
            // Error_report(ERROR_CODE_BSE_LOW, &pedal_err_count.bse.low, bse < 0.0 ? true : false);
            Error_report(ERROR_CODE_BSE_LOW, &pedal_err_count.bse.low, fuzzy_edge_remover(oil_transfer_function(adc_dma_buffer.oil), 70.0, 0.0, 15) < 0.0 ? true : false);
            Error_report(ERROR_CODE_BSE_HIGH, &pedal_err_count.bse.high, fuzzy_edge_remover(oil_transfer_function(adc_dma_buffer.oil), 70.0, 0.0, 5)  > 70.0 ? true : false);
            
            xSemaphoreTake(pedal.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                pedal.apps1 = apps1;
                pedal.apps2 = apps2;
                pedal.bse = bse;
            xSemaphoreGive(pedal.mutex);
        
        
            //update the travel sensor's value
            xSemaphoreTake(travel_strain_oil_sensor.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                travel_strain_oil_sensor.left = travel_transfer_function(adc_dma_buffer.travel_l);
                travel_strain_oil_sensor.right = travel_transfer_function(adc_dma_buffer.travel_r);
                travel_strain_oil_sensor.strain = adc_dma_buffer.strain;
                travel_strain_oil_sensor.oil_pressure = oil_transfer_function(adc_dma_buffer.oil);
            xSemaphoreGive(travel_strain_oil_sensor.mutex);
        
