NTURacingTeam/nturt_stm32_front_box/Core/Src/sensors.c
        }
        if(pending_notifications & FLAG_HALL_EDGE_LEFT) {
            xSemaphoreTake(hall_time_L.mutex, MUTEX_TIMEOUT);
                pending_notifications &= ~FLAG_HALL_EDGE_LEFT; //clear flags

                timer_time_t diff = {0};
                update_time_stamp(&hall_time_L_last, &hall_time_L, &diff);

                xSemaphoreTake(wheel_speed_sensor.mutex, MUTEX_TIMEOUT); 
                    wheel_speed_sensor.left = wheel_speed_tranfser_function(diff.elapsed_count, diff.timer_count);
                xSemaphoreGive(wheel_speed_sensor.mutex);
            xSemaphoreGive(hall_time_L.mutex);
        }
        if(pending_notifications & FLAG_HALL_EDGE_RIGHT) {
            xSemaphoreTake(hall_time_R.mutex, MUTEX_TIMEOUT);
                pending_notifications &= ~FLAG_HALL_EDGE_RIGHT; //clear flags

                timer_time_t diff = {0};
                update_time_stamp(&hall_time_R_last, &hall_time_R, &diff);

                xSemaphoreTake(wheel_speed_sensor.mutex, MUTEX_TIMEOUT);
                    wheel_speed_sensor.right = wheel_speed_tranfser_function(diff.elapsed_count, diff.timer_count);
                xSemaphoreGive(wheel_speed_sensor.mutex);
            xSemaphoreGive(hall_time_R.mutex);
        }
        if(pending_notifications & FLAG_READ_TIRE_TEMP) {
            pending_notifications &= ~FLAG_READ_TIRE_TEMP;
#ifdef USE_D6T
            //read the values from both sensors
            HAL_I2C_Mem_Read_DMA(
                &hi2c5,
                d6t_dma_buffer_R.addr_write, 
                d6t_dma_buffer_R.command, 
                1, 
                &(d6t_dma_buffer_R.PTAT.low), 
                sizeof(d6t_dma_buffer_R.PTAT)+sizeof(d6t_dma_buffer_R.temp)+sizeof(d6t_dma_buffer_R.PEC));
            HAL_I2C_Mem_Read_DMA(
                &hi2c1, 
                d6t_dma_buffer_L.addr_write, 
                d6t_dma_buffer_L.command, 
                1, 
                &(d6t_dma_buffer_L.PTAT.low), 
                sizeof(d6t_dma_buffer_L.PTAT)+sizeof(d6t_dma_buffer_L.temp)+sizeof(d6t_dma_buffer_L.PEC));
            // wait for the DMA to finish, while we can do other stuff in the mean time
            //TODO: setup timeout exception and deal with error case where the stuff did not finish
#endif
        }
        if(pending_notifications & FLAG_I2C1_FINISH) {
            pending_notifications &= ~FLAG_I2C1_FINISH; //clear flags

            //TODO: CRC the data

            xSemaphoreTake(tire_temp_sensor.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                for(int i=0; i<sizeof(d6t_dma_buffer_L.temp)/sizeof(d6t_dma_buffer_L.temp[0]); i++) {
                    tire_temp_sensor.left[i] = tire_temp_transfer_function(d6t_dma_buffer_L.temp[i].high, d6t_dma_buffer_L.temp[i].low);
                }
            xSemaphoreGive(tire_temp_sensor.mutex);
        }
        if(pending_notifications & FLAG_I2C5_FINISH) {
            pending_notifications &= ~FLAG_I2C5_FINISH; //clear flags

            //TODO: CRC the data

            xSemaphoreTake(tire_temp_sensor.mutex, pdMS_TO_TICKS(MUTEX_TIMEOUT));
                for(int i=0; i<sizeof(d6t_dma_buffer_R.temp)/sizeof(d6t_dma_buffer_R.temp[0]); i++) {
                    tire_temp_sensor.right[i] = tire_temp_transfer_function(d6t_dma_buffer_R.temp[i].high, d6t_dma_buffer_R.temp[i].low);
                }
            xSemaphoreGive(tire_temp_sensor.mutex);   
        }
        if(pending_notifications & FLAG_READ_STEER) {
            pending_notifications &= ~FLAG_READ_STEER; //clear flags

            //see https://www.cuidevices.com/product/resource/amt22.pdf
            //TODO: using hardware NSS right now because SCK jitters when NSS is switched by software for some reason
            //but hardware NSS does not observe 3us after all bytes transmission
            spi_tx_buffer[0] = 0;
            spi_tx_buffer[1] = 0;

            if(HAL_SPI_TransmitReceive_IT(&hspi4, spi_tx_buffer, spi_rx_buffer, 2) != HAL_OK) {
                steer_angle_period = STEER_PERIOD_ERR;
                break;
            }
            if(wait_for_notif_flags(FLAG_SPI4_FINISH, pdMS_TO_TICKS(SPI_TIMEOUT), &pending_notifications) != pdTRUE) {
                steer_angle_period = STEER_PERIOD_ERR;
                break;
            }
            else {
                steer_angle_period = STEER_PERIOD_NORMAL;
            }

            //TODO: CRC?

            //calculate position and put the stuff in to variables
            const uint8_t highByte = spi_rx_buffer[0];
            const uint8_t lowByte = spi_rx_buffer[1];
            const uint16_t position = ((uint16_t)highByte << 8) + (uint16_t)lowByte;
            xSemaphoreTake(steer_angle_sensor.mutex, MUTEX_TIMEOUT);
                steer_angle_sensor.steering_angle = steer_angle_transfer_function((position & 0x3FFF) >> 2);
            xSemaphoreGive(steer_angle_sensor.mutex);
        }
    }
}

/**
 * @brief wrapper function to wait for specific bits in the task notification
 * @param target the target that needs to be waited 
 * @param timeout the timeout in ticks
 * @param gotten all the flags that are set. target bits would be autocleared if they are gotten
 * @return the status of the function
 */
BaseType_t wait_for_notif_flags(uint32_t target, uint32_t timeout, uint32_t* const gotten) {    
    uint32_t flag_buf = 0U;
    uint32_t flag_gotten = *gotten;
    const TickType_t t0 = xTaskGetTickCount();
    TickType_t tlast = t0;
    
    //if either of which is not set
    while(~flag_gotten & target) {
        BaseType_t Wait_result = xTaskNotifyWait(0, 0xFFFFFFFFUL, &flag_buf, timeout-(tlast-t0));
        if(Wait_result == pdFALSE) {
            return pdFALSE; 
        }

        flag_gotten |= flag_buf;
        *gotten = flag_gotten;
        tlast = xTaskGetTickCount();
    } 

    //remove the gotten flags if the flags are correctly received
    *gotten &= ~(target);
    return pdTRUE;
}

static void Error_report(uint32_t errFlag, uint16_t* count, bool err) {
    uint32_t prevErr = 0;
    ErrorHandler_get_error(&error_handler, &prevErr);
    const uint32_t isErrSet = prevErr & errFlag;
    if(err) {
        if(*count <= IMPLAUSIBILTITY_PERIOD/SENSOR_TIMER_PERIOD) {
            (*count)++;
        }
    } else *count = 0;

    if(*count >= IMPLAUSIBILTITY_PERIOD/SENSOR_TIMER_PERIOD) {
        if(!isErrSet) ErrorHandler_write_error(&error_handler, errFlag, ERROR_SET);
    }
    else if(isErrSet) {
        ErrorHandler_write_error(&error_handler, errFlag, ERROR_CLEAR);
    }
}

